solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/middleware/sdmmc/sdspi/fsl_sdspi.c
/*******************************************************************************
 * Variables
 ******************************************************************************/

/*******************************************************************************
 * Code
 ******************************************************************************/
static status_t SDSPI_WaitReady(sdspi_host_t *host)
{
    uint8_t response;
    uint8_t timingByte  = 0xFFU; /* The byte need to be sent as read/write data block timing requirement */
    uint32_t retryCount = SDSPI_TRANSFER_RETRY_TIMES;

    do
    {
        if (kStatus_Success != host->exchange(&timingByte, &response, 1U))
        {
            return kStatus_SDSPI_ExchangeFailed;
        }
        retryCount--;
    } while ((response != 0xFFU) && (retryCount != 0U));

    /* Response 0xFF means card is still busy. */
    if (response != 0xFFU)
    {
        return kStatus_SDSPI_ResponseError;
    }

    return kStatus_Success;
}

#if SDSPI_CARD_CRC_PROTECTION_ENABLE
static uint32_t SDSPI_GenerateCRC7(uint8_t *buffer, uint32_t length, uint32_t crc)
{
    uint32_t index;

    static const uint8_t crcTable[] = {0x00U, 0x09U, 0x12U, 0x1BU, 0x24U, 0x2DU, 0x36U, 0x3FU,
                                       0x48U, 0x41U, 0x5AU, 0x53U, 0x6CU, 0x65U, 0x7EU, 0x77U};

    while (length != 0U)
    {
        index = (((crc >> 3U) & 0x0FU) ^ ((*buffer) >> 4U));
        crc   = ((crc << 4U) ^ crcTable[index]);

        index = (((crc >> 3U) & 0x0FU) ^ ((*buffer) & 0x0FU));
        crc   = ((crc << 4U) ^ crcTable[index]);

        buffer++;
        length--;
    }

    return (crc & 0x7FU);
}

static uint16_t SDSPI_GenerateCRC16(uint8_t *buffer, uint32_t length, uint16_t crc)
{
    while (length != 0U)
    {
        crc = (uint8_t)(crc >> 8U) | (crc << 8U);
        crc ^= *buffer++;
        crc ^= (uint8_t)(crc & 0xffU) >> 4U;
        crc ^= (crc << 8U) << 4U;
        crc ^= ((crc & 0xffU) << 4U) << 1U;
        length--;
    }

    return (crc >> 8U) | (crc << 8U);
}
#endif

static status_t SDSPI_SendCommand(sdspi_host_t *host, uint32_t command, uint32_t arg, uint8_t *response)
{
    assert(host != NULL);
    assert(response != NULL);

    uint32_t i;
    uint8_t timingByte = 0xFFU; /* The byte need to be sent as read/write data block timing requirement */
    uint8_t buffer[SDSPI_COMMAND_CODE_BYTE_LEN] = {0U};
    uint32_t responseType                       = SDSPI_COMMAND_FORMAT_GET_RESPONSE_TYPE(command);
    uint8_t index                               = (uint8_t)SDSPI_COMMAND_FORMAT_GET_INDEX(command);

    if ((kStatus_Success != SDSPI_WaitReady(host)) && (index != (uint8_t)kSDMMC_GoIdleState))
    {
        return kStatus_SDSPI_WaitReadyFailed;
    }

    /* Send command. */
    buffer[0U] = (index | 0x40U);
    buffer[1U] = (uint8_t)((arg >> 24U) & 0xFFU);
    buffer[2U] = (uint8_t)((arg >> 16U) & 0xFFU);
    buffer[3U] = (uint8_t)((arg >> 8U) & 0xFFU);
    buffer[4U] = (uint8_t)(arg & 0xFFU);
#if SDSPI_CARD_CRC_PROTECTION_ENABLE
    buffer[5U] = ((SDSPI_GenerateCRC7(buffer, 5U, 0U) << 1U) | 1U);
#else
    if (index == (uint8_t)kSDMMC_GoIdleState)
    {
        buffer[5U] = SDSPI_COMMAND_IDLE_CRC;
    }
    else if (index == (uint8_t)kSD_SendInterfaceCondition)
    {
        buffer[5U] = SDSPI_COMMAND_SEND_INTERFACE_CRC;
    }
    else
    {
        /* Intentional empty */
    }
#endif

    if (host->exchange(buffer, NULL, SDSPI_COMMAND_CODE_BYTE_LEN) != kStatus_Success)
    {
        return kStatus_SDSPI_ExchangeFailed;
    }

    /* Wait for the response coming, the left most bit which is transfered first in first response byte is 0 */
    for (i = 0U; i < 9U; i++)
    {
        if (kStatus_Success != host->exchange(&timingByte, &response[0U], 1U))
        {
            return kStatus_SDSPI_ExchangeFailed;
        }

        /* Check if response 0 coming. */
        if (0U == (response[0U] & 0x80U))
        {
            break;
        }
    }

    if ((response[0U] & 0x80U) != 0U) /* Max index byte is high means response comming. */
    {
        return kStatus_SDSPI_ResponseError;
    }

    if (responseType != (uint32_t)kSDSPI_ResponseTypeR1)
    {
        if (responseType == (uint32_t)kSDSPI_ResponseTypeR1b)
        {
            if (kStatus_Success != SDSPI_WaitReady(host))
            {
                return kStatus_SDSPI_WaitReadyFailed;
            }
        }
        else if (responseType == (uint32_t)kSDSPI_ResponseTypeR2)
        {
            if (kStatus_Success != host->exchange(&timingByte, &(response[1U]), 1U))
            {
                return kStatus_SDSPI_ExchangeFailed;
            }
        }
        else if ((responseType == (uint32_t)kSDSPI_ResponseTypeR3) || (responseType == (uint32_t)kSDSPI_ResponseTypeR7))
        {
            /* Left 4 bytes in response type R3 and R7(total 5 bytes in SPI mode) */
            if (kStatus_Success != host->exchange(&timingByte, &(response[1U]), 4U))
            {
                return kStatus_SDSPI_ExchangeFailed;
            }
        }
        else
        {
            /* Intentional empty */
        }
    }

    return kStatus_Success;
}

#if SDSPI_CARD_CRC_PROTECTION_ENABLE
status_t SDSPI_CommandCrc(sdspi_card_t *card, bool enable)
{
    uint8_t response = 0U;

    if (kStatus_Success != SDSPI_SendCommand(card->host, kSDSPI_CmdCrc, enable, &response))
    {
        return kStatus_SDSPI_SendCommandFailed;
    }

    return kStatus_Success;
}
#endif

static status_t SDSPI_GoIdle(sdspi_card_t *card)
{
    assert(card != NULL);
    assert(card->host != NULL);

    uint8_t response    = 0U;
    uint32_t retryCount = SDSPI_TRANSFER_RETRY_TIMES;

    /* SD card will enter SPI mode if the CS is asserted (negative) during the reception of the reset command (CMD0)
    and the card will be IDLE state. */
    do
    {
        if ((kStatus_Success == SDSPI_SendCommand(card->host, kSDSPI_CmdGoIdle, 0U, &response)) &&
            (response == (uint8_t)kSDSPI_R1InIdleStateFlag))
        {
            return kStatus_Success;
        }
    } while (--retryCount != 0U);

    return kStatus_SDSPI_SendCommandFailed;
}

static status_t SDSPI_SendInterfaceCondition(sdspi_card_t *card, uint32_t *flags)
{
    assert(card != NULL);
    assert(card->host != NULL);

