solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/middleware/sdmmc/sdspi/fsl_sdspi.c
    uint8_t response[5U] = {0U};
    uint32_t i           = SDSPI_TRANSFER_RETRY_TIMES;

    do
    {
        /* CMD8 is used to check if the card accept the current supply voltage and check if
        the card support CMD8 */
        if (kStatus_Success == SDSPI_SendCommand(card->host, kSDSPI_CmdSendInterfaceCondition, 0x1AAU, response))
        {
            /* not support CMD8, clear hcs flag */
            if ((response[0U] & (uint8_t)kSDSPI_R1IllegalCommandFlag) != 0U)
            {
                return kStatus_Success;
            }
            /* if VCA is set and pattern is match, then break */
            if ((response[3U] == 0x1U) && (response[4U] == 0xAAU))
            {
                *flags |= SDMMC_MASK(kSD_OcrHostCapacitySupportFlag);
                return kStatus_Success;
            }
            /* if VCA in the reponse not set, then the card not support current voltage, return fail */
            else if (response[3U] == 0U)
            {
                return kStatus_SDSPI_InvalidVoltage;
            }
            else
            {
                /* Intentional empty */
            }
        }
        else
        {
            return kStatus_SDSPI_SendCommandFailed;
        }
    } while (--i != 0U);

    return kStatus_Fail;
}

static status_t SDSPI_SendApplicationCmd(sdspi_card_t *card)
{
    assert(card != NULL);
    assert(card->host != NULL);

    uint8_t response = 0U;

    if (kStatus_Success != SDSPI_SendCommand(card->host, kSDSPI_CmdApplicationCmd, 0U, &response))
    {
        return kStatus_SDSPI_SendCommandFailed;
    }

    if ((response != 0U) && (0U == (response & (uint8_t)kSDSPI_R1InIdleStateFlag)))
    {
        return kStatus_SDSPI_ResponseError;
    }

    return kStatus_Success;
}

static status_t SDSPI_ApplicationSendOperationCondition(sdspi_card_t *card, uint32_t argument)
{
    assert(card != NULL);
    assert(card->host != NULL);

    uint8_t response = 0U;
    uint32_t i       = SDSPI_TRANSFER_RETRY_TIMES;

    do
    {
        if (kStatus_Success == SDSPI_SendApplicationCmd(card))
        {
            if (kStatus_Success ==
                SDSPI_SendCommand(card->host, kSDSPI_CmdAppSendOperationCondition, argument, &response))
            {
                if ((response & (uint8_t)kSDSPI_R1InIdleStateFlag) == 0U)
                {
                    return kStatus_Success;
                }
            }
        }

    } while (--i != 0U);

    return kStatus_Fail;
}

static status_t SDSPI_ReadOcr(sdspi_card_t *card)
{
    assert(card != NULL);
    assert(card->host != NULL);

    uint32_t i           = 0U;
    uint8_t response[5U] = {0U};

    if (kStatus_Success != SDSPI_SendCommand(card->host, kSDSPI_CmdReadOcr, 0U, response))
    {
        return kStatus_SDSPI_SendCommandFailed;
    }

    if (response[0U] != 0U)
    {
        return kStatus_SDSPI_ResponseError;
    }

    /* Switch the bytes sequence. All register's content is transferred from highest byte to lowest byte. */
    card->ocr = 0U;
    for (i = 4U; i > 0U; i--)
    {
        card->ocr |= (uint32_t)response[i] << ((4U - i) * 8U);
    }

    if ((card->ocr & SDMMC_MASK(kSD_OcrCardCapacitySupportFlag)) != 0U)
    {
        card->flags |= (uint32_t)kSDSPI_SupportHighCapacityFlag;
    }

    return kStatus_Success;
}

static status_t SDSPI_SetBlockSize(sdspi_card_t *card, uint32_t blockSize)
{
    assert(card != NULL);
    assert(card->host != NULL);

    uint8_t response = 0U;
    uint32_t i       = SDSPI_TRANSFER_RETRY_TIMES;

    do
    {
        if (kStatus_Success == SDSPI_SendCommand(card->host, kSDSPI_CmdSetBlockLength, blockSize, &response))
        {
            return kStatus_Success;
        }
    } while (--i != 0U);

    return kStatus_Fail;
}

static void SDSPI_DecodeCsd(sdspi_card_t *card, uint8_t *rawCsd)
{
    assert(rawCsd != NULL);
    assert(card != NULL);

    sd_csd_t *csd = &(card->csd);

    csd->csdStructure        = (rawCsd[0U] >> 6U);
    csd->dataReadAccessTime1 = rawCsd[1U];
    csd->dataReadAccessTime2 = rawCsd[2U];
    csd->transferSpeed       = rawCsd[3U];
    csd->cardCommandClass    = (uint16_t)(((uint32_t)rawCsd[4U] << 4U) | ((uint32_t)rawCsd[5U] >> 4U));
    csd->readBlockLength     = ((rawCsd)[5U] & 0xFU);
    if ((rawCsd[6U] & 0x80U) != 0U)
    {
        csd->flags |= (uint16_t)kSD_CsdReadBlockPartialFlag;
    }
    if ((rawCsd[6U] & 0x40U) != 0U)
    {
        csd->flags |= (uint16_t)kSD_CsdWriteBlockMisalignFlag;
    }
    if ((rawCsd[6U] & 0x20U) != 0U)
    {
        csd->flags |= (uint16_t)kSD_CsdReadBlockMisalignFlag;
    }
    if ((rawCsd[6U] & 0x10U) != 0U)
    {
        csd->flags |= (uint16_t)kSD_CsdDsrImplementedFlag;
    }

    /* Some fileds is different when csdStructure is different. */
    if (csd->csdStructure == 0U) /* Decode the bits when CSD structure is version 1.0 */
    {
        csd->deviceSize =
            ((((uint32_t)rawCsd[6] & 0x3U) << 10U) | ((uint32_t)rawCsd[7U] << 2U) | ((uint32_t)rawCsd[8U] >> 6U));
        csd->readCurrentVddMin    = ((rawCsd[8U] >> 3U) & 7U);
        csd->readCurrentVddMax    = (rawCsd[8U] >> 7U);
        csd->writeCurrentVddMin   = ((rawCsd[9U] >> 5U) & 7U);
        csd->writeCurrentVddMax   = (rawCsd[9U] >> 2U);
        csd->deviceSizeMultiplier = (((rawCsd[9U] & 3U) << 1U) | (rawCsd[10U] >> 7U));

        card->blockCount = (csd->deviceSize + 1U) << (csd->deviceSizeMultiplier + 2U);
        card->blockSize  = (1UL << (csd->readBlockLength));

        if (card->blockSize != FSL_SDSPI_DEFAULT_BLOCK_SIZE)
        {
            card->blockCount = (card->blockCount * card->blockSize);
            card->blockSize  = FSL_SDSPI_DEFAULT_BLOCK_SIZE;
            card->blockCount = (card->blockCount / card->blockSize);
        }
        /* CSD V1.0 support SDSC card only */
        card->flags |= (uint32_t)kSDSPI_SupportSdscFlag;
    }
    else if (csd->csdStructure == 1U) /* Decode the bits when CSD structure is version 2.0 */
    {
        card->blockSize = FSL_SDSPI_DEFAULT_BLOCK_SIZE;
        csd->deviceSize =
            ((((uint32_t)rawCsd[7U] & 0x3FU) << 16U) | ((uint32_t)rawCsd[8U] << 8U) | ((uint32_t)rawCsd[9U]));
        if (csd->deviceSize >= 0xFFFFU)
        {
            card->flags |= (uint32_t)kSDSPI_SupportSdxcFlag;
        }
        else
        {
            card->flags |= (uint32_t)kSDSPI_SupportSdhcFlag;
        }
        card->blockCount = ((csd->deviceSize + 1U) * 1024U);
    }
    else
    {
        /* Intentional empty */
    }

    if (((rawCsd[10U] >> 6U) & 1U) != 0U)
    {
        csd->flags |= (uint16_t)kSD_CsdEraseBlockEnabledFlag;
    }
    csd->eraseSectorSize       = (((rawCsd[10U] & 0x3FU) << 1U) | (rawCsd[11U] >> 7U));
    csd->writeProtectGroupSize = (rawCsd[11U] & 0x7FU);
    if ((rawCsd[12U] >> 7U) != 0U)
    {
        csd->flags |= (uint16_t)kSD_CsdWriteProtectGroupEnabledFlag;
    }
    csd->writeSpeedFactor = ((rawCsd[12U] >> 2U) & 7U);
    csd->writeBlockLength = (((rawCsd[12U] & 3U) << 2U) | (rawCsd[13U] >> 6U));
    if (((rawCsd[13U] >> 5U) & 1U) != 0U)
    {
        csd->flags |= (uint16_t)kSD_CsdWriteBlockPartialFlag;
    }
    if ((rawCsd[14U] >> 7U) != 0U)
    {
        csd->flags |= (uint16_t)kSD_CsdFileFormatGroupFlag;
    }
    if (((rawCsd[14U] >> 6U) & 1U) != 0U)
    {
        csd->flags |= (uint16_t)kSD_CsdCopyFlag;
    }
    if (((rawCsd[14U] >> 5U) & 1U) != 0U)
    {
        csd->flags |= (uint16_t)kSD_CsdPermanentWriteProtectFlag;
    }
    if (((rawCsd[14U] >> 4U) & 1U) != 0U)
    {
        csd->flags |= (uint16_t)kSD_CsdTemporaryWriteProtectFlag;
    }
    csd->fileFormat = ((rawCsd[14U] >> 2U) & 3U);
}

